Revit 2024 API
AreaLoad.GetLoops Method
 Returns curve loops that define geometry of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<CurveLoop> GetLoops()
Visual Basic
Public Function GetLoops As IList(Of CurveLoop)
Visual C++
public:
IList<CurveLoop^>^ GetLoops()
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace